Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: The reference count is important because today's computers have a finite (and often severely limited) memory size; it counts how many different places there are that have a reference to an object. Such a place could be another object, or a global (or static) C variable, or a local variable in some C function. When an object's reference count becomes zero, the object is deallocated. If it contains references to other objects, their reference count is decremented. Those other objects may be deallocated in turn, if this decrement makes their reference count become zero, and so on. (There's an obvious problem with objects that reference each other here; for now, the solution is "don't do that.")
pl: Liczba odniesień jest istotna, gdyż dzisiejsze komputery mają skończony (i zwykle poważnie ograniczony) rozmiar pamięci; liczy ona jak wiele różnych miejsc istnieje, które przechowują odniesienie do przedmiotu. Takie miejsce może być innym przedmiotem, zmienną C nadrzędnego poziomu (lub statyczną), lub lokalną zmienną w jakimś zadaniu języka C. Gdy liczba odniesień do przedmiotu staje się równa zero, przedmiot jest zdejmowany z pamięci. Jeśli zawiera odniesienia do innych przedmiotów liczba odniesień do nich jest obniżana po jednym dla każdego. Te inne przedmioty mogą być zdejmowane z pamięci w konsekwencji, jeśli obniżenie liczby odniesień do nich spowoduje że liczba odniesień stanie się równa zero, itd. (Istnieje dość oczywisty problem z przedmiotami które wzajemnie się odnoszą do siebie; na razie rozwiązaniem jest "proszę tak nie robić.")

source: Reference counts are always manipulated explicitly. The normal way is to use the macro :cfunc:`Py_INCREF` to increment an object's reference count by one, and :cfunc:`Py_DECREF` to decrement it by one. The :cfunc:`Py_DECREF` macro is considerably more complex than the incref one, since it must check whether the reference count becomes zero and then cause the object's deallocator to be called. The deallocator is a function pointer contained in the object's type structure. The type-specific deallocator takes care of decrementing the reference counts for other objects contained in the object if this is a compound object type, such as a list, as well as performing any additional finalization that's needed. There's no chance that the reference count can overflow; at least as many bits are used to hold the reference count as there are distinct memory locations in virtual memory (assuming ``sizeof(Py_ssize_t) >= sizeof(void*)``). Thus, the reference count increment is a simple operation.
pl: Liczby odniesień są zawsze zmieniane jawnie. Zwykłym sposobem jest użycie makropolecenia :cfunc:`Py_INCREF` aby zwiększyć liczbę odniesień dla przedmiotu o jeden, i makropolecenie :cfunc:`Py_DECREF` aby zmniejszyć ją o jeden. Makropolecenie :cfunc:`Py_DECREF` jest z konieczności bardziej złożone niż to zwiększające o nazwie incref, gdyż musi sprawdzać czy liczba odniesień staje się równa zero i dopiero wtedy powodować wezwanie zdjęcia przedmiotu z pamięci. Zadanie zdejmujące jest wskaźnikiem na zadanie zawarte w strukturze typu przedmiotu. Szczególne dla każdego rodzaju zadanie zajmuje się zmniejszeniem liczby odniesień dla innych przedmiotów zawartych w przedmiocie, jeśli jest to przedmiot o złożonym rodzaju, takim jak lista, zarówno jak wykonując dowolne dodatkowe zakańczanie jeśli jest to konieczne. Nie ma możliwości aby liczba odniesień uległa przepełnieniu; przynajmniej tak wiele bitów użyto do przechowywania liczby odniesień, jak wiele jest różnych miejsc w pamięci w pamięci wirtualnej (zakładając ``sizeof(Py_ssize_t) >= sizeof(void*)``). Zatem zwiększenie liczby odniesień jest prostą operacją.

source: It is not necessary to increment an object's reference count for every local variable that contains a pointer to an object. In theory, the object's reference count goes up by one when the variable is made to point to it and it goes down by one when the variable goes out of scope. However, these two cancel each other out, so at the end the reference count hasn't changed. The only real reason to use the reference count is to prevent the object from being deallocated as long as our variable is pointing to it. If we know that there is at least one other reference to the object that lives at least as long as our variable, there is no need to increment the reference count temporarily. An important situation where this arises is in objects that are passed as arguments to C functions in an extension module that are called from Python; the call mechanism guarantees to hold a reference to every argument for the duration of the call.
pl: Nie jest konieczne zwiększanie zwiększanie liczby odniesień do przedmiotu dla każdej lokalnej zmiennej która zawiera wskaźnik na przedmiot. Teoretycznie, liczba odniesień do przedmiotu zwiększa się o jeden gdy zmienna jest zmuszana do wskazywania nań i jest zmniejszana o jeden gdy zmienna wychodzi z widoku. Jednakże te dwa działania wykluczają się nawzajem, więc ostatecznie liczba odniesień nie ulega zmianie. Jedynym prawdziwym powodem użycia liczby odniesień jest aby uniemożliwić zdjęcie z pamięci przedmiotu tak długo jak nasza zmienna nań wskazuje. Jeśli wiemy, że istnieje przynajmniej jedno inne odniesienie do przedmiotu, które żyje tak długo jak nasza zmienna, nie ma potrzeby zwiększania liczby odniesień tymczasowo. Istotną sytuacją gdzie to się pojawia jest w obiektach które są przekazywane jako parametry do zadań C w modułach rozszerzających które są wywoływane przez polecenia języka pytonowskiego; mechanizm wywołania gwarantuje przytrzymanie odniesienia do każdego parametru na czas wywołania zadania z tym parametrem.

source: However, a common pitfall is to extract an object from a list and hold on to it for a while without incrementing its reference count. Some other operation might conceivably remove the object from the list, decrementing its reference count and possible deallocating it. The real danger is that innocent-looking operations may invoke arbitrary Python code which could do this; there is a code path which allows control to flow back to the user from a :cfunc:`Py_DECREF`, so almost any operation is potentially dangerous.
pl: Jednakże typową pułapką jest wyjęcie przedmiotu z listy i przetrzymanie go przez pewien czas bez zwiększenia liczby odniesień. Jakaś inna operacja może wyobrażalnie usunąć ten przedmiot z listy, zmniejszając liczbę odniesień do niego. Prawdziwym niebezpieczeństwem jest to, że niewinnie-wyglądające operacje mogą wywoływać dowolny kod w języku pytonowskim który może tego dokonać; istnieje ścieżka kodowa która pozwala aby przebieg wykonania został zwrócony do użytkownika z makropolecenia :cfunc:`Py_DECREF`, tak że prawie każda operacja jest potencjalnie niebezpieczna.

source: A safe approach is to always use the generic operations (functions whose name begins with ``PyObject_``, ``PyNumber_``, ``PySequence_`` or ``PyMapping_``). These operations always increment the reference count of the object they return. This leaves the caller with the responsibility to call :cfunc:`Py_DECREF` when they are done with the result; this soon becomes second nature.
pl: Bezpiecznym podejściem jest zawsze używać operacji podstawowych (zadań których nazwy zaczynają się ``PyObject_``, ``PyNumber_``, ``PySequence_`` lub ``PyMapping_``). Te operacje zawsze zwiększają o jeden liczbę odniesień przedmiotu który zwracają. To pozostawia wołającego obarczonego odpowiedzialnością za wywołanie :cfunc:`Py_DECREF` gdy już skończy działać na wyniku; można się do tego przyzwyczaić.

source: Reference Count Details
pl: Szczegóły Liczby Odniesień

source: The reference count behavior of functions in the Python/C API is best explained in terms of *ownership of references*. Ownership pertains to references, never to objects (objects are not owned: they are always shared). "Owning a reference" means being responsible for calling Py_DECREF on it when the reference is no longer needed. Ownership can also be transferred, meaning that the code that receives ownership of the reference then becomes responsible for eventually decref'ing it by calling :cfunc:`Py_DECREF` or :cfunc:`Py_XDECREF` when it's no longer needed---or passing on this responsibility (usually to its caller). When a function passes ownership of a reference on to its caller, the caller is said to receive a *new* reference. When no ownership is transferred, the caller is said to *borrow* the reference. Nothing needs to be done for a borrowed reference.
pl: Zachowanie liczby odniesień w zadaniach sprzęgu między językami pytonowskim i języku C najlepiej wyjaśniać w kategoriach *właściciela odniesień*. Własność dotyczy odniesień, nigdy przedmiotów (przedmioty nie mają posiadacza: zamiast tego są współdzielone). "Posiadanie odniesienia" oznacza bycie odpowiedzialnym za wezwanie Py_DECREF na nim gdy odniesienie nie jest już więcej potrzebne. Akt własności może być przekazywany, co oznacza że kod który otrzymuje odniesienie na własność staje się odpowiedzialny za ostateczne jego "zdecrefowanie" przez wywołanie :cfunc:`Py_DECREF` lub :cfunc:`Py_XDECREF`gdy nie jest już więcej potrzebne --- lub przekazanie tej odpowiedzialności (zwykle swojemu wywołującemu). Gdy zadanie przekaże własność odniesienia do swojego wywołującego to zadanie, o wołającym mówi się, że otrzymał *nowe* odniesienie. Gdy żadna własność nie jest przenoszona, o wywołującym mówi się że *pożycza* odniesienie. Nic nie jest wymagane do zrobienia dla pożyczonego odniesienia.

source: Conversely, when a calling function passes in a reference to an object, there are two possibilities: the function *steals* a reference to the object, or it does not. *Stealing a reference* means that when you pass a reference to a function, that function assumes that it now owns that reference, and you are not responsible for it any longer.
pl: Idąc dalej, gdy wywołujące zadanie przekazuje odniesienie do przedmiotu, istnieją dwie możliwości: zadanie *kradnie* odniesienie do przedmiotu, lub nie kradnie go. *Kradnięcie odniesienia* oznacza, że gdy przekazujesz odniesienie do zadania, to zadanie przyjmuje, że teraz ono posiada odniesienie i nie jesteś za nie odpowiedzialny ani chwili dłużej.

source: Few functions steal references; the two notable exceptions are :cfunc:`PyList_SetItem` and :cfunc:`PyTuple_SetItem`, which steal a reference to the item (but not to the tuple or list into which the item is put!). These functions were designed to steal a reference because of a common idiom for populating a tuple or list with newly created objects; for example, the code to create the tuple ``(1, 2, "three")`` could look like this (forgetting about error handling for the moment; a better way to code this is shown below)::
pl: Niewiele zadań kradnie referencje; dwoma szczególnymi wyjątkami są :cfunc:`PyList_SetItem` i :cfunc:`PyTuple_SetItem`, które kradną odniesienie do przedmiotu (ale nie do krotki czy listy do których przedmiot jest wkładany!). Te zadania zostały zaprojektowane tak, aby kraść odniesienie z powodu wspólnego idiomu dla zapełnienia krotki czy listy nowo utworzonymi przedmiotami; na przykład, kod do tworzenia krotki ``(1,2, "trzy")`` mógłby wyglądać następująco (pomijając błąd obsługę błędów tymczasowo; lepszy sposób na zakodowanie tego pokazany jest poniżej)::

source: Here, :cfunc:`PyLong_FromLong` returns a new reference which is immediately stolen by :cfunc:`PyTuple_SetItem`. When you want to keep using an object although the reference to it will be stolen, use :cfunc:`Py_INCREF` to grab another reference before calling the reference-stealing function.
pl: Tutaj, :cfunc:`PyLong_FromLong` zwraca nowe odniesienie, które jest natychmiast kradzione przez zadanie :cfunc:`PyTuple_SetItem`. Gdy chcesz nadal używać przedmiotu pomimo tego, że odniesienie do niego zostanie skradzione, używaj makropolecenia :cfunc:`Py_INCREF` aby schwycić jeszcze jedno odniesienie przed wywołaniem kradnącego-odniesienia zadania.

source: Incidentally, :cfunc:`PyTuple_SetItem` is the *only* way to set tuple items; :cfunc:`PySequence_SetItem` and :cfunc:`PyObject_SetItem` refuse to do this since tuples are an immutable data type. You should only use :cfunc:`PyTuple_SetItem` for tuples that you are creating yourself.
pl: Przypadkowo zadanie :cfunc:`PyTuple_SetItem` jest *jedynym* sposobem aby ustawiać elementy krotek; Zadania :cfunc:`PySequence_SetItem` i :cfunc:`PyObject_SetItem` odmawiają wykonania tego samego działania gdyż krotki są niezmiennym rodzajem danych. Powinieneś używać tylko :cfunc:`PyTuple_SetItem` dla krotek, które tworzysz własnoręcznie.

source: Equivalent code for populating a list can be written using :cfunc:`PyList_New` and :cfunc:`PyList_SetItem`.
pl: Równoważny kod dla zapełnienia listy można napisać używając: zadań :cfunc:`PyList_New` i :cfunc:`PyList_SetItem`.

source: However, in practice, you will rarely use these ways of creating and populating a tuple or list. There's a generic function, :cfunc:`Py_BuildValue`, that can create most common objects from C values, directed by a :dfn:`format string`. For example, the above two blocks of code could be replaced by the following (which also takes care of the error checking)::
pl: Jednakże, w praktyce, rzadko używa się tych sposobów tworzenia i zapełniania krotek czy list. Istnieje funkcja prosta :cfunc:`Py_BuildValue`, która może tworzyć większość typowych przedmiotów z wartości zapisanych w języku C, określona przez :dfn:`ciąg formatu`. Na przykład, powyższe dwa fragmenty kodu mogłyby być zastąpione przez następujący (który także zajmuje się sprawdzaniem błędów)::

source: PyObject *tuple, *list; tuple = Py_BuildValue("(iis)", 1, 2, "three"); list = Py_BuildValue("[iis]", 1, 2, "three");
pl: PyObject *krotka, *lista; krotka = Py_BuildValue("(iis)", 1, 2, "trzy"); lista = Py_BuildValue("[iis]", 1, 2, "trzy");

source: It is much more common to use :cfunc:`PyObject_SetItem` and friends with items whose references you are only borrowing, like arguments that were passed in to the function you are writing. In that case, their behaviour regarding reference counts is much saner, since you don't have to increment a reference count so you can give a reference away ("have it be stolen"). For example, this function sets all items of a list (actually, any mutable sequence) to a given item::
pl: Dużo częściej spotyka się użycie zadania :cfunc:`PyObject_SetItem` i zaprzyjaźnionych z elementami których odniesienia tylko się pożycza, jak parametrów, które zostały przekazane do funkcji którą piszesz. W takim przypadku, ich zachowanie w stosunku do liczb odniesień jest dużo zdrowsze, gdyż nie musisz zwiększać liczby odniesień, kiedy chcesz oddać odniesienie ("pozwolić aby zostało ukradzione"). Na przykład, to zadanie ustawia wszystkie elementy listy (właściwie dowolnej zmiennej sekwencji) na dany element::

source: int set_all(PyObject *target, PyObject *item) { int i, n; n = PyObject_Length(target); if (n < 0) return -1; for (i = 0; i < n; i++) { PyObject *index = PyLong_FromLong(i); if (!index) return -1; if (PyObject_SetItem(target, index, item) < 0) return -1; Py_DECREF(index); } return 0; }
pl: int ustaw_wszystkie(PyObject *cel, PyObject *element) { int i, n; n = PyObject_Length(cel); if (n < 0) return -1; for (i = 0; i < n; i++) { PyObject *nr = PyLong_FromLong(i); if (!nr) return -1; if (PyObject_SetItem(cel, nr, element) < 0) return -1; Py_DECREF(nr); } return 0; }

source: The situation is slightly different for function return values. While passing a reference to most functions does not change your ownership responsibilities for that reference, many functions that return a reference to an object give you ownership of the reference. The reason is simple: in many cases, the returned object is created on the fly, and the reference you get is the only reference to the object. Therefore, the generic functions that return object references, like :cfunc:`PyObject_GetItem` and :cfunc:`PySequence_GetItem`, always return a new reference (the caller becomes the owner of the reference).
pl: Sytuacja jest trochę inna dla wartości zwracanych z zadania. Podczas gdy przekazywanie odniesienia do większości zadań nie zmienia twojego odpowiedzialności właścicielskiej za to odniesienie, wiele zadań, które zwracają odniesienie do przedmiotu daje też odniesienie do tego przedmiotu na własność. Powód jest prosty: w wielu przypadkach przedmiot zwracany tworzony jest w locie i odniesienie które dostajesz jest jedynym odniesieniem do tego obiektu. Zatem proste zadania które zwracają odniesienia do przedmiotów, jak :cfunc:`PyObject_GetItem` i :cfunc:`PySequence_GetItem`, zawsze zwracają nowe odniesienia (wywoływujący zadanie staje się właścicielem odniesienia).

source: It is important to realize that whether you own a reference returned by a function depends on which function you call only --- *the plumage* (the type of the object passed as an argument to the function) *doesn't enter into it!* Thus, if you extract an item from a list using :cfunc:`PyList_GetItem`, you don't own the reference --- but if you obtain the same item from the same list using :cfunc:`PySequence_GetItem` (which happens to take exactly the same arguments), you do own a reference to the returned object.
pl: Jest istotne zdać sobie sprawę, że to, czy posiadasz odniesienie zwrócone przez zadanie, zależy tylko od tego, które zadanie wywołasz --- *pakuły* (przedmioty przekazywane jako parametry zadania) *nie odnoszą się do tego!* Zatem, jeśli wyjmiesz element z listy używając :cfunc:`PyList_GetItem`, nie posiądziesz odniesienia --- ale jeśli otrzymasz ten sam element z tej samej listy korzystając z :cfunc:`PySequence_GetItem` (które przyjmuje dokładnie te same parametry), posiadasz odniesienie do zwróconego przedmiotu.

source: Here is an example of how you could write a function that computes the sum of the items in a list of integers; once using :cfunc:`PyList_GetItem`, and once using :cfunc:`PySequence_GetItem`. ::
pl: Tutaj jest przykład tego, jak można zapisać zadanie, które oblicza sumę wszystkich elementów na liście liczb całkowitych; raz przy użyciu :cfunc:`PyList_GetItem`, a raz przy użyciu :cfunc:`PySequence_GetItem`

source: long sum_list(PyObject *list) { int i, n; long total = 0; PyObject *item; n = PyList_Size(list); if (n < 0) return -1; /* Not a list */ for (i = 0; i < n; i++) { item = PyList_GetItem(list, i); /* Can't fail */ if (!PyLong_Check(item)) continue; /* Skip non-integers */ total += PyLong_AsLong(item); } return total; }
pl: long sumuj_liste(PyObject *lista) { int i, n; long suma = 0; PyObject *element; n = PyList_Size(lista); if (n < 0) return -1; /* To nie lista */ for (i = 0; i < n; i++) { element = PyList_GetItem(lista, i); /* Nie może zawieźć */ if (!PyLong_Check(element)) continue; /* Pomiń nie będące całkowitymi liczbami */ suma += PyLong_AsLong(element); } return suma; }

source: long sum_sequence(PyObject *sequence) { int i, n; long total = 0; PyObject *item; n = PySequence_Length(sequence); if (n < 0) return -1; /* Has no length */ for (i = 0; i < n; i++) { item = PySequence_GetItem(sequence, i); if (item == NULL) return -1; /* Not a sequence, or other failure */ if (PyLong_Check(item)) total += PyLong_AsLong(item); Py_DECREF(item); /* Discard reference ownership */ } return total; }
pl: long sumuj_sekwencje(PyObject *sekwencja) { int i, n; long suma = 0; PyObject *element; n = PySequence_Length(sekwencja); if (n < 0) return -1; /* Nie ma długości */ for (i = 0; i < n; i++) { element = PySequence_GetItem(sekwencja, i); if (element == NULL) return -1; /* To nie sekwencja, lub inny błąd */ if (PyLong_Check(element)) suma += PyLong_AsLong(element); Py_DECREF(element); /* Odrzuć własność odniesień */ } return suma; }

source: Types
pl: Typy

source: There are few other data types that play a significant role in the Python/C API; most are simple C types such as :ctype:`int`, :ctype:`long`, :ctype:`double` and :ctype:`char\*`. A few structure types are used to describe static tables used to list the functions exported by a module or the data attributes of a new object type, and another is used to describe the value of a complex number. These will be discussed together with the functions that use them.
pl: Istnieje kilka innych typów danych które pełnią ważną rolę w sprzęgu pomiędzy językami pytonowskim i C (API); większość jest prostymi typami języka C takimi jak :ctype:`int`, :ctype:`long`, :ctype:`double`, :ctype`char\*`. Kilka typów struktur jest używanych do opisania statycznych tabel używanych do wypisywania zadań wystawianych na zewnątrz modułu lub własności danych nowych rodzajów przedmiotów, a inne używane są do opisania wartości liczby zespolonej. Te będą opisane razem z zadaniami, które ich używają.

source: Exceptions
pl: Sytuacje Wyjątkowe

source: The Python programmer only needs to deal with exceptions if specific error handling is required; unhandled exceptions are automatically propagated to the caller, then to the caller's caller, and so on, until they reach the top-level interpreter, where they are reported to the user accompanied by a stack traceback.
pl: Programujący komputer w języku pytonowskim musi sobie zaprzątać głowę tylko sytuacjami wyjątkowymi tylko jeśli szczególna obsługa błędów jest konieczna; Nieobsłużone wyjątki są automatycznie przesyłane do zadania wywołującego, potem do zadania które wywołało tamto zadanie, i tak dalej, dopóki nie natrafi na program interpretujący najwyższego poziomu, gdzie są przekazywane użytkownikowi wraz z wypisem kolejnych wywołań odłożonych na stercie.

source: For C programmers, however, error checking always has to be explicit. All functions in the Python/C API can raise exceptions, unless an explicit claim is made otherwise in a function's documentation. In general, when a function encounters an error, it sets an exception, discards any object references that it owns, and returns an error indicator --- usually *NULL* or ``-1``. A few functions return a Boolean true/false result, with false indicating an error. Very few functions return no explicit error indicator or have an ambiguous return value, and require explicit testing for errors with :cfunc:`PyErr_Occurred`.
pl: Dla programujących w języku C, jednakże, sprawdzanie błędów, zawsze musi być jawne. Wszystkie zadania w sprzęgu między językami pytonowskim a C mogą zgłaszać sytuacje wyjątkowe, chyba że jawne założenie zostało poczynione o innym brzmieniu w dokumentacji zadania. Zasadniczo jeśli zadanie napotka błąd, ustawia sytuację wyjątkową, odrzuca wszystkie odniesienia do przedmiotów które posiada i zwraca wskaźnik błędu --- zwykle *NULL* lub ``-1``. Kilka zadań zwraca prawdę/fałsz jako wynik, z fałszem wskazującym błąd. Bardzo mało zadań nie zwraca żadnych jawnych wskazań błędu, czy ma dwuznaczną wartość zwracaną i wymaga jawnego sprawdzenia błędów przy użyciu :cfunc:`PyErr_Occurred`.
